{
    "content": "<p>Insulated roof panels consist of metal panels with steel skins and an insulating foam core. This core adds a layer of insulation which increases the energy efficiency. They are known for their superior thermal properties, design flexibility and quick installation time and great look. Insulated roofs are high-quality and ready to assemble options for the homeowner interested in a clean, professional looking finished product at a fraction of the cost.</p>\n<figure class=\"text-center\"><img src=\"/assets/images/insulated_roofing_panel.png\" alt=\"Insulated Roof panel layers\" class=\"img-fluid\"/></figure><p>These roof panels are weather-sealed and provide a strong thermal and moisture barrier.  Our engineered roof panel joints provide protection from wind, rain and moisture and allow aesthetic integration of different profile types.</p>\n<p>These permanent insulated patio covers not only protect against rain and snow, but also reduce heat transfer to the underside of the unit and keep your new space up to 15 degrees cooler on those extreme summer days. Each system is engineered according to your local code requirements for wind and snow loads and delivered directly to you. Available in almost any dimension and a range of colors and options.</p>\n<p>Our core competency is the application, design and manufacturing of insulated metal panels and accessories. Our roof metal panels are so versatile that they are the top choice for thermally-efficient metal building systems, including food, agricultural, pharmaceutical, retail, and zero-energy residential applications.</p>\n<p>They are suitable as a cost-effective, energy-efficient alternative to brick, wood, cinder block or bare metal sheathing over a steel grid. Our composite panels are customizable, using high R-value expanded polystyrene cores and a variety of exterior metal skins for tailor-made panel building systems.</p>",
    "content2":"<p>Our insulated metal roof systems are easy-to-install, economical solution, require low maintenance, and have superior thermal performance. Our range of insulated roof panels includes insulated standing seam and insulated trapezoidal options. These panels offer best-in-class R-value combined with modern aesthetic looks that will compliment any project.</p>\n<p>Insulated metal roofs offer years of maintenance free protection and guarantee never rust, warp, crack or rot or become infested with insects. Never re-stain, re-shingle or reseal your patio cover again!</p>\n<p>Our most popular patio cover can be configured to meet local building codes for wind loads throughout the USA. Fully engineered and walkable load bearing EPS core roof panels are combined with high quality extruded aluminum framing system to help you create your perfect cover from the elements and add instant value to your home.</p>\n<p>Insulated roof panels are not, but also provide unparalleled R-values and energy efficiency.</p> ",
    "content3":"<p>We offer different insulated roof profiles. Both use industry-leading PIR foam insulation cores, which provide increased thermal performance and fire resistance compared to older PUR foam types.</p>\n<p>From 3 inches to 6 inches roof system gives superior strength and durability. The selection of roof thickness is determined by the load rating requirements of your local building department. Smartloc panels made with a high density 1.5 lb expanded polystyrene core offer a fast and easy installation as they snap together with a 15 year warranty. A customer favorite given their durability and thermal performance.</p>"
}