{
    "content": "<p>American Aluminum fabricators offers metal roofing for both residential and commercial buildings. With our own inhouse metal roof roll forming equipment and sheet metal shop, we can deliver projects in a very cost-efficient and timely manner. We can provide 20,25, & 35-year warranties for your metal roof. Did you know that Metal roofs reflect solar radiant heat, which can reduce cooling costs by 10-25%?</p><p>Environmentally friendly Metal roofs not only have 25-95% recycled content, depending on the material used but are also 100% recyclable at the end of their life as a roof.</p><div class=\"block-quote\"><div class=\"container\"><div class=\"row\"><div class=\"col-10 mx-auto block-quote_icon\">A contemporary metal roof on a home can improve that home's resale value by 6 percent when compared with an asphalt-shingled home. Additionally, you'll recoup an average of 85.9 percent of your costs on a metal roof.</div></div></div></div><p>Metal roofs last longer than most other conventional roof systems and metal roofs are lighter by weight and hold up better during high winds. The site formed seamless panels mean that your roof panels will be seamless from eve to the ridge which equals no leaks ever.</p><p>Metal roofs offer many benefits, including:</p><ul><li><strong>Longevity.</strong>Metal roofs can last 40-70 years, depending on the material. Traditional asphalt roofing materials have an estimated life expectancy of roughly 12-20 years.</li><li><strong>Durability.</strong>Some metal roofs can sustain wind gusts up to 140 miles per hour, will not corrode or crack, and may be impact-resistant (depending on which metal you choose). In addition, metal roofs don’t need the periodic costly maintenance that other roofing materials often require. However, they should be inspected periodically to make sure no repairs are required.</li><li><strong>Safety.</strong>Metal roofs will not spark and ignite into flames during a wildfire or lightning strike.</li><li><strong>Energy efficiency.</strong>Metal roofs reflect solar radiant heat, which can reduce cooling costs by 10-25%.</li><li><strong>Environmentally friendly.</strong>Metal roofs not only have 25-95% recycled content, depending on the material used, but are also 100% recyclable at the end of their life as a roof. In contrast, most shingle tear-off waste ends up as part of the building-related waste stream — up to 20 billion pounds per year.</li></ul></div>"
}